app/Traits/AccountsTrait.php

select * from `accounts` where `accounts`.`account_id` = '2' limit 1
---
    public function bootAccountsTrait()
    {
        try {
            $this->envIsLocal   = (Str::afterLast($_SERVER['HTTP_HOST'], '.') == 'local');
            $this->account      = Account::findOrFail(session('account.id'));

select `account_id`, `account_name`, `account_slug`, `account_enabled` from `accounts` where `accounts`.`account_id` = '2' limit 1
---
    public function getCurrentAccount()
    {
        try {
            return Account::select('account_id','account_name','account_slug','account_enabled')->findOrFail(session('account.id'));