app/Traits/DevicesTrait.php

select * from `accounts` where `account_id` = '2' limit 1
---
    public function getAlertDevices($state = 'all', $alerts = [])
    {
        if(count($alerts) == 0){
            return (new Collection);
        }
        $accountId = session('account.id');
        $this->account = Account::where('account_id','=',$accountId)->first();