app/Models/User.php

	public function getAccountsAttribute()
	{
		$accountIds = $this->getAccountIds();
		return Account::select('account_id','account_name','account_translation','account_slug','account_enabled')->whereIn('account_id',$accountIds)->enabled()->get();
---
select `account_id`, `account_name`, `account_translation`, `account_slug`, `account_enabled` from `accounts` where `account_id` in (2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 24) and `account_enabled` = 1

	public function getAccountIds()
	{
		if( Auth::user()->hasRole('site') ){
			$accounts = Account::query()->where('account_enabled','=',1)->pluck('account_id')->toArray();
---
select `account_id` from `accounts` where `account_enabled` = 1